TC02.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="TC02" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TC02_Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">3</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="TC02_HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">opensource-demo.orangehrmlive.com</stringProp>
          <stringProp name="HTTPSampler.path">/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="TC02_View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="TC02_View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="TC02_Response Assertion1" enabled="true">
        <collectionProp name="Asserion.test_strings">
          <stringProp name="2524">OK</stringProp>
        </collectionProp>
        <stringProp name="Assertion.test_field">Assertion.response_message</stringProp>
        <boolProp name="Assertion.assume_success">false</boolProp>
        <intProp name="Assertion.test_type">2</intProp>
      </ResponseAssertion>
      <hashTree/>
      <ResultCollector guiclass="AssertionVisualizer" testclass="ResultCollector" testname="TC02_Assertion Results" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="TC02_Response Assertion2" enabled="true">
        <collectionProp name="Asserion.test_strings">
          <stringProp name="49586">200</stringProp>
        </collectionProp>
        <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
        <boolProp name="Assertion.assume_success">false</boolProp>
        <intProp name="Assertion.test_type">8</intProp>
      </ResponseAssertion>
      <hashTree/>
      <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="TC02_Response Assertion3" enabled="true">
        <collectionProp name="Asserion.test_strings">
          <stringProp name="-1606201635">HTTP/1.1 200 OK</stringProp>
        </collectionProp>
        <stringProp name="Assertion.test_field">Assertion.response_headers</stringProp>
        <boolProp name="Assertion.assume_success">false</boolProp>
        <intProp name="Assertion.test_type">2</intProp>
      </ResponseAssertion>
      <hashTree/>
      <SizeAssertion guiclass="SizeAssertionGui" testclass="SizeAssertion" testname="TC02_Size Assertion" enabled="true">
        <stringProp name="Assertion.test_field">SizeAssertion.response_network_size</stringProp>
        <stringProp name="SizeAssertion.size">1000</stringProp>
        <intProp name="SizeAssertion.operator">3</intProp>
      </SizeAssertion>
      <hashTree/>
      <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="TC02_Duration Assertion" enabled="true">
        <stringProp name="DurationAssertion.duration">5000</stringProp>
      </DurationAssertion>
      <hashTree/>
      <HTMLAssertion guiclass="HTMLAssertionGui" testclass="HTMLAssertion" testname="TC02_HTML Assertion" enabled="true">
        <longProp name="html_assertion_error_threshold">10</longProp>
        <longProp name="html_assertion_warning_threshold">30</longProp>
        <stringProp name="html_assertion_doctype">omit</stringProp>
        <boolProp name="html_assertion_errorsonly">false</boolProp>
        <longProp name="html_assertion_format">0</longProp>
        <stringProp name="html_assertion_filename">C:\apache-jmeter-5.5\HTMLReports.txt</stringProp>
      </HTMLAssertion>
      <hashTree/>
      <XMLAssertion guiclass="XMLAssertionGui" testclass="XMLAssertion" testname="TC02_XML Assertion" enabled="false"/>
      <hashTree/>
      <XMLSchemaAssertion guiclass="XMLSchemaAssertionGUI" testclass="XMLSchemaAssertion" testname="TC02_XML Schema Assertion" enabled="false">
      </XMLSchemaAssertion>
      <hashTree/>
      <XPathAssertion guiclass="XPathAssertionGui" testclass="XPathAssertion" testname="TC02_XPath Assertion" enabled="true">
        <boolProp name="XPath.negate">true</boolProp>
        <stringProp name="XPath.xpath">//*[@id=&quot;app&quot;]/div[1]/div/div[1]/div/div[1]/img</stringProp>
        <boolProp name="XPath.validate">false</boolProp>
        <boolProp name="XPath.whitespace">false</boolProp>
        <boolProp name="XPath.tolerant">true</boolProp>
        <boolProp name="XPath.namespace">false</boolProp>
      </XPathAssertion>
      <hashTree/>
      <JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion" testname="TC02_JSON Assertion" enabled="true">
        <stringProp name="JSON_PATH">$</stringProp>
        <boolProp name="JSONVALIDATION">false</boolProp>
        <boolProp name="EXPECT_NULL">false</boolProp>
        <boolProp name="INVERT">false</boolProp>
        <boolProp name="ISREGEX">true</boolProp>
      </JSONPathAssertion>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>